<template>
  <TxtDec
    :text="text"
    :line="line"
  />
</template>

<script>
import { reactive, toRefs } from '@vue/reactivity'

export default {
  name: 'App',
  setup () {
    const state = reactive({
      line: 2,
      text: `从仓颉造字的古老传说到公元前1000多年前甲骨文的发现，历代中国学者一直致力于揭开汉字起源之谜。关于汉字起源的说法，历来各家有不同主张，其中比较有影响力的说法有：结绳说、八卦说、刻契说、仓颉造字说、刻划说和图画说。
      结绳说：在文字产生之前，古人们靠结绳记事、认事，此举起到了帮助人们记忆的作用。《周易·系辞下》：“上古结绳而治，后世圣人易之以书契，百官以治，万民以察。”汉代郑玄注：“结绳为约，事大，大结其绳；事小，小结其绳。”
      《庄子·胠箧》篇云：“昔者容成氏、大庭氏、伯皇氏、中央氏、栗陆氏、骊畜氏、轩辕氏、赫胥氏、尊卢氏、祝融氏、伏羲氏、神农氏，当是时也，民结绳而用之。”又如《周易正义》引《虞郑九家义》： “古者无文字，其有约誓之事，
      事大大结其绳，事小小结其绳。结之多少，随物众寡；各执以相考，亦足以相治也。”东汉以后，不少人把汉字起源附会于结绳[5]  。
      八卦说：关于八卦的起源说法并不统一，有摹象说、星象说、数说和杨雄的“亥”为物之源说等等。《周易·系辞》云：“古者庖牺氏之王天下也，仰则观象于天，俯则观法于地，观鸟兽之文与地之宜，近取诸身，远取诸物，于是始作八卦，
      以通神明之德，以类万物之情。”这段话提到八卦源自庖牺氏对自然客观世界的摹象，这与“依类象形”而作的汉字的起源是相似的。孔安国《尚书》序（属伪作，但年代甚古）里说：“古者庖牺氏之王天下也，始画八卦，造书契，以代结绳之政，由是文籍生焉。”把八卦和书契（文字）的作用相提并论，把汉字的起源与八卦联系起来[5]  。
      仓颉造字说：相传仓颉是黄帝时期的史官，汉字的创造者[6]  。黄帝是古代中原部落联盟的领袖，由于社会进入较大规模的部落联盟阶段，联盟之间外交事务日益频繁，故迫切需要建立一套各盟联共享的交际符号，于是搜集及整理共享文字的工作便交在史官仓颉的手上了。`
    })

    return {
      ...toRefs(state)
    }
  }
}
</script>

<style>
</style>
